### One_Hot_Encoding

In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.read_csv('titanic.csv',usecols=['Sex'])
df.head()

      Sex
0    male
1  female
2  female
3  female
4    male

In [3]:
pd.get_dummies(df).head()

   Sex_female  Sex_male
0           0         1
1           1         0
2           1         0
3           1         0
4           0         1

In [4]:
pd.get_dummies(df,drop_first=True).head()

   Sex_male
0         1
1         0
2         0
3         0
4         1

In [5]:
df = pd.read_csv('titanic.csv',usecols=['Embarked'])
df.head()

  Embarked
0        S
1        C
2        S
3        S
4        S

In [6]:
df['Embarked'].unique()

array(['S', 'C', 'Q', nan], dtype=object)

In [7]:
df.dropna(inplace = True)

In [8]:
df['Embarked'].unique()

array(['S', 'C', 'Q'], dtype=object)

In [9]:
pd.get_dummies(df).head()

   Embarked_C  Embarked_Q  Embarked_S
0           0           0           1
1           1           0           0
2           0           0           1
3           0           0           1
4           0           0           1

In [10]:
pd.get_dummies(df,drop_first=True).head()

   Embarked_Q  Embarked_S
0           0           1
1           0           0
2           0           1
3           0           1
4           0           1

In [11]:
## Many category in a feature

In [12]:
df = pd.read_csv('mercedes.csv',usecols=["X0","X1","X2","X3","X4","X5","X6"])
df.head()

   X0 X1  X2 X3 X4 X5 X6
0   k  v  at  a  d  u  j
1   k  t  av  e  d  y  l
2  az  w   n  c  d  x  j
3  az  t   n  f  d  x  l
4  az  v   n  f  d  h  d

In [13]:
df['X0'].value_counts()

z     360
ak    349
y     324
ay    313
t     306
x     300
o     269
f     227
n     195
w     182
j     181
az    175
aj    151
s     106
ap    103
h      75
d      73
al     67
v      36
af     35
ai     34
m      34
e      32
ba     27
at     25
a      21
ax     19
am     18
aq     18
i      18
u      17
l      16
aw     16
ad     14
b      11
au     11
k      11
r      10
as     10
bc      6
ao      4
c       3
aa      2
q       2
g       1
ac      1
ab      1
Name: X0, dtype: int64

In [14]:
df['X0'].unique()

array(['k', 'az', 't', 'al', 'o', 'w', 'j', 'h', 's', 'n', 'ay', 'f', 'x',
       'y', 'aj', 'ak', 'am', 'z', 'q', 'at', 'ap', 'v', 'af', 'a', 'e',
       'ai', 'd', 'aq', 'c', 'aa', 'ba', 'as', 'i', 'r', 'b', 'ax', 'bc',
       'u', 'ad', 'au', 'm', 'l', 'aw', 'ao', 'ac', 'g', 'ab'],
      dtype=object)

In [15]:
print(len(df['X0'].unique()))

47

In [16]:
for i in df.columns:
    print(len(df[i].unique()))

47
27
44
7
4
29
12

In [17]:
df.X1.value_counts().sort_values(ascending = False).head(10)

aa    833
s     598
b     592
l     590
v     408
r     251
i     203
a     143
c     121
o      82
Name: X1, dtype: int64

In [18]:
lst_10 = df.X1.value_counts().sort_values(ascending=False).head(10).index
lst_10 = list(lst_10)

In [19]:
lst_10

['aa', 's', 'b', 'l', 'v', 'r', 'i', 'a', 'c', 'o']

In [20]:
for categories in lst_10:
    df['categories'] = np.where(df['X1'] == categories,1,0)

In [21]:
df['X1']

0        v
1        t
2        w
3        t
4        v
5        b
6        r
7        l
8        s
9        b
10       r
11       r
12       b
13       r
14       s
15       l
16       r
17      aa
18       c
19       a
20       s
21      aa
22       r
23       b
24       r
25       s
26       l
27      aa
28       s
29       b
        ..
4179     a
4180     v
4181     r
4182     v
4183    aa
4184     s
4185     v
4186     f
4187     l
4188     s
4189     s
4190     s
4191     v
4192     l
4193     v
4194     o
4195     l
4196     o
4197     v
4198     a
4199    aa
4200    aa
4201     v
4202     l
4203     s
4204     s
4205     o
4206     v
4207     r
4208     r
Name: X1, Length: 4209, dtype: object

In [22]:
lst_10.append('X1')

In [24]:
df.head()

   X0 X1  X2 X3 X4 X5 X6  categories
0   k  v  at  a  d  u  j           0
1   k  t  av  e  d  y  l           0
2  az  w   n  c  d  x  j           0
3  az  t   n  f  d  x  l           0
4  az  v   n  f  d  h  d           0